Repository: giellalt/corpus-nob
Catalog: stable/tmx/sme/facta/skuvlahistorja6/janna-n.html.tmx
Source language: nob
Languages: sme

source: Skole i Karasjok og Beaivvášgieddi
sme: Skuvla Kárášjogas ja Beaivvášgiettis

source: Fortalt til Janna Balto
sme: Muitaluvvon Janna Baltoi

source: Tvillingene Mary Laila Rasmus (Jánssa Máret Mary Láilá) og Helga Sofie Sollien (Jánssa Máret Helga Sofe) er født i juli 1932 på Ravnastua.
sme: Jumeš guovttos Jánssa Máret Mary Láilá (Mary Laila Rasmus) ja Jánssa Máret Helga Sofe (Helga Sofie Sollien) leaba riegádan suoidnemánus 1932 Gárdinis.

source: De bodde på Ravnastua og gikk på skole i Karasjok sentrum fram til evakueringa.
sme: Soai oruiga Gárdinis ja vácciiga skuvlla Kárášjoga márkanbáikkis dassá evakuerenáigi álggii.

source: Etter det flytta de til Beaivvášgieddi og fortsatte skolegangen der fram til Den samiske folkehøgskolen starta opp.
sme: Dan maŋŋel sii fárrejedje Beaivvášgieddái gos jotkkiiga skuvlla dassá Sámi álbmotallaskuvlii (DSF) álggiiga.

source: Her forteller de litt om hvordan de hadde det under grunnskolegangen.
sme: Muitaleaba veahá dan skuvlla dili birra mii sudnos lei vuođđoskuvllas.

source: Intervjuer Janna Hagelin Balto er født i Karasjok november 1983, og bor der.
sme: Jearahalli Janna Hagelin Balto lea riegádan skábmamánus 1983 Kárášjogas ja ássá doppe.

source: Janna Balto (Foto utlånt av Janna Balto)
sme: Janna Balto (Govva luoikan Janna Balto)

source: De begynte på skolen høsten 1939 da de var sju år gamle. Det var tre mil å gå fra Ravnastua til skolen i Karasjok sentrum.
sme: Soai álggiiga skuvlii čakčat 1939 go leigga čieža jagi boarrásat, sudnos lei golbma miilla vázzit Gárdinis Kárášjoga márkanii gos skuvlla lei.

source: De hadde en storesøster som pleide å gå sammen med dem til besteforeldrene deres i sentrum, hvor tvillingsøstrene skulle bo mens de gikk på skolen.
sme: Sudno boarrásat oabbá láve sudno mieđuštit márkanii áhkus ja ádjás lusa gos galggaiga orrut dan botta go skuvla lei.

source: Skolen varte tre måneder om gangen.
sme: Skuvla bisti golbma mánu ain hávális.

source: Det var til stor økonomisk hjelpe for besteforeldrene å ha barnebarna boende der, for de som tok inn skoleelever, fikk økonomisk støtte til det.
sme: Áhkkui ja áddjái lei stuorra veahkki ruđalaččat ahte soai oruiga doppe, go dalle lávejedje oažžut vehá skuvllaruđa sii geat válde ohppiid orrut iežaset lusa.

source: Når de begynte i første klasse på skolen hadde de en lærerinne som de kalte «frøken Mørk».
sme: Go sii álge skuvlii vuosttaš luohkkái lei sis oahpaheaddji gean gohčodedje «frøken Mørk».

source: De gikk i en klasse hvor det var omtrent førti elever tilsammen. Noen av dem var åtte eller kanskje ni år før de begynte i første klasse.
sme: Sis lei luohkká gos ledje sullii njealljelogi oahppi oktiibuot ja muhtimat ledje gávcci ja kánske ovcci jagi ovdal go álge vuosttaš luohkkái.

source: «Frøken Mørk» var rivgu og hun snakka bare norsk.
sme: «Frøken Mørk» lei rivgu ja son beare hálai dárogiela.

source: Det var ingen i klassen som forsto hva hun sa og hva hun fortalte, enkelte hadde bare lært å hilse god dag og god kveld.
sme: Luohkás ii lean ii oktage gii áddii maid son hálai ja muitalii, muhtimat ledje dušše oahppan buorre beaivvi ja buorre eahkeda rávkat.

source: Hver morgen når de kom, startet dagen med en kristen andakt og en salme som de sang før undervisninga starta opp.
sme: Juohke iđida go bohte lei vuos risttalaš logaldallan ja sálbma maid sii lávlo ovdal go álggahedje oahpahusa.

source: Første skoledag fikk alle en bok som de kalte 1, regnebok, noe å skrive på, blyant og viskelær.
sme: Vuosttaš skuvlabeaivvi sii buohkat ožžo «áppes»-girjji [1], rehkenastingirjji, juoga masa čállit, bliántta ja sihkkungummi.

source: Leksene de fikk kunne de ikke gjøre, for bestemor kunne ikke hjelpe dem, og bestefar som forsto litt norsk, hadde ikke tid til å hjelpe dem fordi det var så mye annet arbeid.
sme: Bihtát maid oaččuiga eai šaddan dahkkot go áhkku ii máhttán ja áddjá gii vehá áddii dárogiela ii astan veahkehit go ledje nu ollu eará barggut.

source: De ble straffet
sme: Ráŋggáštuvvojedje

source: De ble straffet hvis de ikke hadde lest og øvd på leksene sine.
sme: Sii ráŋggáštuvvojedje jus eai lean lohkan ja hárjehallan bihtáid.

source: Læreren satte dem i ovnskroken hvor det var så varmt og trangt at de slett ikke hadde lyst til å komme dit en gang til, men det var likevel ikke så lett å huske leksene.
sme: Oahpaheaddji bijai sin čuožžut liegga uvdnagurrii ovtta čihkii gos lei nu báhkas ja gárži ahte gal nuppes ii lean gal šat miella dohko, muhto ii lean álo nu álki muitit dan.

source: Hvis de snakka samisk seg imellom når de var ute og lekte, eller inne i klasserommet, fikk de både ørefik og tre slag over fingrene med pekestokken, og det var veldig vondt når den sinte læreren slo barna på fingrene.
sme: Jus sámástedje gaskaneaset go ledje olgun stoahkamin dahje luohkkálanjas de oahpaheaddji runddii beallji duohken sisa pultta lusa ja huškkui suorpmaid golmma geardde dainna čujonasain (soabbi mainna čujuhii távvala go oahpahii sin), ja dat han gal lei jo nu bávččas go suhttan oahpaheaddji máná suorpmaid hušku.

source: De fikk også straff hvis de mista noen av skolesakene som de hadde fått.
sme: Jos sii láhppe maidige skuvlla diŋggaid maid ledje ožžon skuvllas de maid oahpaheaddji ráŋggáštii sin.

source: Det var heller ikke lov til å forstyrre andre eller plage andre, da ble man også satt i den varme ovnskroken, eller man ble slått over fingrene.
sme: Ii lean lohpi earáige muosehuhttit dahje givssidit, dalle maid biddjui dan báhkka čihkii čuožžut dahje suorpmaide huškojuvvui.

source: Fra andre til fjerde klasse
sme: Nuppis gitta njealját luohkkái

source: Fra og med andre klasse ble elevene delt mer opp.
sme: Nuppi luohká rájes sirrejedje vehá daid ohppiid.

source: De som hadde arbeida bra og lært seg litt norsk, fikk komme i en egen klasse hvor det var et ektepar som underviste. Det var bedre å være der, man lærte mer, og ble ikke straffet.
sme: Sii geat ledje bures bargan ja oahppan vehá dárogiela besse sierra luohkkái gos lei okta almmái ja su eamit geat oahpaheigga, lei buoret dilli doppe gos ohppe eambbo eaige ráŋggáštuvvon.

source: Men Mary Laila og Helga Sofie fikk ikke gå i den klassen, for de hadde ikke lært norsk.
sme: Muhto soai gal eaba beassan dohko go eaba lean oahppan dárogiela.

source: Da de begynte i andre og tredje klasse fikk de også historiebok, geografibok, katekisme og skjønnskriftbok.
sme: Go nuppi ja goalmmát luohkkái álggiiga de oaččuiga maid historjágirjji, geografiijagirjji, Katekismusa ja «skjønnskrift» girjii.

source: Læreren hadde alt skrevet i skjønnskriftboka, og så skulle elevene skrive akkurat etter de strekene som læreren hadde laget.
sme: Dán skjønnskrift-girjji lei oahpaheaddji gárvvisin čállán ja sii galge čállit juste daid sárgáid mielde maid oahpaheaddji lei jo čállán.

source: De viste boka til læreren, og hvis de ikke hadde skrevet nøyaktig etter lærerens streker, måtte de gjøre det på nytt.
sme: Sii galge čájehit dan ja jos eai lean deaivan juste sárgái mielde čállit de galge fas ođđasit čállit.

source: De forsto aldri hva det var som var skrevet i denne skjønnskriftboka, og læreren leste heller ikke høyt hva det var som sto der.
sme: Eaba soai ádden goassige maid soai čáliiga ja oahpaheaddji maid ii lohkan jitnosit dan mii doppe čuoččui.

source: De måtte også ta badstu på skolen to ganger i måneden. Barna ble skurt nesten til blods.
sme: Skuvllas lei maid bággu guktii mánus sávnnodit, doppe skuvrejedje mánáid masá varrii.

source: Det kom også en sykepleier dit og greide håret deres for å se om de hadde lus, hun vaska håret deres med en sterktluktende olje som svidde og gjorde vondt.
sme: Buohccidivššár maid finai dalle čohkumin sin oivviid, geahččan dihte leat go dihkit sis ja basai vuovttaid dakkár garra oljjuin mii nu hilaštii ja bávččagii.

source: Mens de gikk på skolen i Karasjok var det krig, så de ble sendt hjem flere ganger i midten av en skoletur fordi tyskerne kom for å bo på skolen.
sme: Dán áiggi go leigga Kárášjogas skuvllas lei maid soahti nu ahte soai sáddejuvvuiga ruoktot máŋgii ovtta skuvlaáigodagas, go duiskalaččat bohte ja áigo orrut skuvllas.

source: De var på skolen bare kort tid, omtrent to uker, også ble de sendt hjem igjen fordi tyskerne kom.
sme: Sii ledje skuvllas oanehis áigge sullii guokte vahkku ja fas sáddejuvvojedje ruoktot go duiskalaččat ledje jođus.

source: Under evakueringa flytta familien fra Ravnastua til Beaivvášgieddi, og da fikk Mary Laila og Helga Sofie begynne på skolen der.
sme: Beaivvášgietti skuvla Evakueren áigge fárrii bearaš Gárdinis Beaivvášgieddái ja dalle soai beasaiga dohko álgit skuvlii.

source: Men skolehverdagen endra seg ikke med det.
sme: Muhto skuvlla dilli gal ii earáhuvvan gal dainna.

source: Det ble kanskje ennå verre, for nå var alle klassene samla på ett sted, og læreren, Kåre Nordland, hadde ikke tid til å hjelpe de større elevene som hadde blitt hengende etter med skolearbeidet.
sme: Šattai ain vearrát dilli gánske, dál ledje buot luohkát ovtta sajis ja oahpaheaddji Kåre Nordland gii doppe lei oahpaheaddjin ii astan veahkehit šat sin geat ledje boarrásat ja bázahallan skuvlabargguin.

source: Han prioriterte å hjelpe første- og andreklasseelevene, så de større barna som ikke hadde lært norsk og ikke kunne noe, hadde ikke lenger noen nytte av skolegangen.
sme: Son vuoruhii veahkehit vuosttaš ja nuppi luohká oahppi, nu ahte boarrásat mánát geat eai lean oahppan dárogiela eaige máhttán maidige eai atnán šat ávkki skuvllas.

source: Hjemme hadde de ei mor som kunne snakke litt norsk, og hun ville forstått norsk, men hun hadde ikke tid til å hjelpe dem med leksene fordi det var så mye annet arbeid man måtte gjøre for å komme gjennom hverdagen, og de måtte også selv hjelpe foreldrene med det daglige arbeidet.
sme: Ruovttus gos sudno eadni máhtii vehá dárostit ja livččii ádden dárogiela, ii son astan veahkehit bihtáiguin go dan áiggi ledje nu ollu eará barggut maid fertii dahkat vai birgejit beaivválaččat, ja ieža maid fertiiga veahkehit váhnemiid bargguiguin.

source: På Beaivvášgieddi var det også søndagsskole som prestefrua Margarethe Wiig ledet. Der skulle de vite hva de hadde lest og hørt, men det visste de jo ikke, for de forsto jo ikke hva de leste.
sme: Beaivvášgiettis lei maiddái sotnabeaiveskuvla gos báhpa eamit Margarethe Wiig oahpahii sin, doppe sii galge diehtit maid sii leat lohkan ja gullan, muhto eai diehtán go eai ádden maid sii lohke.

source: Det de to husker veldig godt er da de skulle feire 17. mai, de skulle samles og være glade og gå i tog.
sme: Dan maid muitiba hui bures lea go galge ávvudit miessemánu 17. beaivvi. Sii galge čoahkkanit illudit ja vázzit toga.

source: Læreren fortalte hvorfor de skulle gå i tog, og hvorfor man skulle feire denne dagen.
sme: Oahpaheaddji muitalii manin sii galge vázzit toga ja manin dán beaivvi ávvudit.

source: Mora deres var der og tolket det læreren sa om denne dagen, og de fikk boller og kakao. Det at de fikk tolking var veldig bra, og derfor husker de hva de hørte den dagen.
sme: Sudno eadni lei das ja dulkui sudnuide maid oahpaheaddji muitalii dan beaivvi birra, sii ožžo bolláid ja kakáo, ja dat ahte dat dulkojuvvui lei hui buorre ja muitiba maid dan maid dalle gulaiga.

source: Konfirmasjonsskolen var også på Beaivvášgieddi. Den varte i fire måneder, og når de var ferdige med den, var de også ferdige på skolen.
sme: Konfirmašuvdnaskuvla mii lei maid Beaivvášgiettis bisttii njeallje mánu ja go dan vel gearggai de lei geargan skuvllas.

source: Der skulle man lære bibelvers utenat. Hvis man ikke kunne dem utenat ble man tatt ut av skolen, og så måtte man prøve på nytt neste år.
sme: Doppe galggai oahppat biibbalvearssaid ja máhttit dan bajiloaivvi, ja jus ii máhttán dan de biddjui eret skuvllas ja fertii ođđasit geahččalit nuppi jagi fas.

source: Det var både trist og pinlig, for denne undervisninga var også bare på norsk, og det var så fælt, for de forsto ikke språket, og da forsto de jo ikke hva de hadde lest og lært.
sme: Dat gal lei stuorra váivi ja heahpat. Dát oahpahus manai maid dárogillii ja lei hui váivi go ii máhttán giela iige ádden maid lei lohkan ja oahppan.

source: De leste og leste for at de skulle huske hvordan de skulle si fram teksten.
sme: Soai logaiga ja logaiga vai muitiba mo galggai lohkat dan teavstta.

source: Da de ble ferdige på skolen, flytta de til Karasjok sentrum og begynte på DSF.
sme: Go gearggaiga skuvllas de fárriiga Kárášjoga márkanbáikái ja álggiiga Sámi álbmotallaskuvlii (DSF).

source: Der lærte de litt norsk, for der var det flere hjelpere som tolket og forklarte hva de leste, slik at de lærte noe.
sme: Doppe oahpaiga vehá dárogiela go doppe ledje eambbo veahkit geat dulkojedje ja muitaledje maid sii lohket vai oahppaba.

source: Og så fikk de venner som de samarbeida med, og slik lærte de.
sme: Ja oaččuiga skihpáriid geaiguin ovttas barge ja ohppe.

source: Det var Samemisjonen som eide DSF.
sme: Sámi álbmotallaskuvlla eaiggádii Sámemiššuvdna.

source: Det var samisktalende folk der, så der var det lettere å lære norsk, for der kunne de tolke når søstrene ikke forsto det de leste.
sme: Doppe ledje olbmot geat hálle sámegiela, nu ahte doppe lei álkit oahppat dárogiela go doppe sáhtte dulkostit go eaba ádden maid lohkaba.

source: De minnes nå den tunge tida som de gjennomlevde da.
sme: Muittašeaba dál dan losses áiggi mii lei dalle.

source: Være borte hjemmefra i månedsvis, lengte hjem til mamma, søstre og brødre.
sme: Ruovttus jávkat mánnoviissaid, áibbašeigga ruoktot eatniska, oappáideaskka ja vieljaideaskka lusa.

source: De forsto ikke språket og de lærte ingenting i løpet av skoletida.
sme: Giela eaba ádden ja eabage oahppan maidige skuvlaáigodagas.

source: Enkelte tekster har brent seg fast i minnet fordi de leste dem om og om igjen hver dag.
sme: Leat teavsttat mat leat báhcán muitui go leaba dalle juohke beaivvi lohkan dan seamma ja seamma.

source: Hvordan ville det vært nå, hvis sjuårige barn skulle vært borte fra sin egen mor mange måneder i strekk?
sme: Mo son dál livčče jus mánát čiežajahkásažžan galggašedje jávkat eatnis eret máŋggaid mánuid háválassii?

source: Det må ha vært en veldig trist og tung tid den gangen da fornorskninga var så hard.
sme: Ferte gal leamaš ahkit ja losses áigi go dat dáruiduhttin lei nie garas.

source: Du forstår ikke språket, du aner ikke hva læreren sier og underviser.
sme: It ádde giela, it dieđe maid oahpaheaddji lohká ja oahpaha.

source: Men likevel må du sitte stille og lytte og prøve å forstå.
sme: Muhto fertet gal čohkkát jaska ja guldalit ja geahččalit áddet.

source: Du får ikke snakke ditt eget språk som du kan godt, samisk skal ikke høres i skoletida.
sme: It oaččo hállat iežat eatnigiela maid hálddašat bures, ii oaččo gullat sámegiela skuvlaáigodagas.

source: Flere artikler fra Samisk skolehistorie 6
sme: Eará artihkkalat Sámi skuvlahistorjá 6-girjjis
